{
	"languages": [
		{
			"key": "en",
			"name": "English",
			"icon": "flag_us"
		},
		{
			"key": "fr",
			"name": "Français",
			"icon": "flag_fr"
		}
	],
	"dictionary": {
		"fr": {
			"setlanguage-choose": "Veuillez choisir un des langages supportés.",
			"setlanguage-chosen": "La langue du bot est désormais le Français. ",
			"tournament-system-tournament-not-found-error": "Le tournoi n'a pas été trouvé : le code du tournoi a-t-il été bien saisi?",
			"tournament-system-participant-not-found": "action non effectuée, impossible de trouver dans la liste des participants du tournoi (est-il bien inscrit?) le joueur suivant : ",
			"tournament-join-prefix": "Résultats de l'inscription au tournoi ",
			"tournament-system-unauthorized-access": "vous ne pouvez pas rejoindre ce tournoi car il n'est pas organisé par l'administrateur de votre Discord",
			"tournament-system-registration-closed": "il n'est plus possible de s'inscrire au tournoi. Le tournoi doit être commencé ou fini.",
			"tournament-system-join-error": "Erreur lors de l'inscription : ",
			"tournament-system-join-error-reason1": "le tournoi est complet et ne possède pas de file d'attente.",
			"tournament-system-join-success": "votre inscription au tournoi a bien été prise en compte",
			"tournament-system-join-success-waiting-list": "le tournoi est complet : vous avez été placé en file d'attente",
			"tournament-leave-prefix": "Résultats de la désinscription au tournoi ",
			"tournament-system-leave-error": "Erreur inconnue lors de la désinscription au tournoi. Vous ne pouvez vous désinscrire qu'aux tournois de l'organisateur de ce Discord",
			"tournament-system-participant-disactivated": "vous avez déclaré forfait avec succès pour les prochains matchs du tournoi (votre participation est désactivée). Si vous voulez reprendre le tournoi, contactez l'admin du tournoi.",
			"tournament-system-leave-success": "votre désinscription au tournoi a bien été prise en compte",
			"tournament-next-match-prefix": "Recherche de votre prochain match pour le tournoi ",
			"tournament-system-next-match-tournament-not-started": " le tirage au sort n'a pas encore été effectué. Votre prochain match est donc encore inconnu.",
			"tournament-system-tournament-is-finished": " le tournoi est terminé, il n y a plus de matchs à jouer.",
			"tournament-system-winner-is-error": "Il y a eu une erreur lors de la déclaration du vainqueur. Voir avec l'admin",
			"join-command-description": "Join a tournament by specifying its code (code is given in the tournament description)",
			"join-command-trcode-missing-arg": "Add tournament's code you would like to join",
			"join-command-already-registered": "vous êtes déjà inscrit au tournoi demandé",
			"leave-command-description": "Leave a tournament by specifying its code (code is given in the tournament page)",
			"leave-command-trcode-missing-arg": "Precise the tournament code you would like to leave",
			"leave-command-already-left": "vous n'êtes pas inscrit à ce tournoi, vous ne pouvez donc pas vous en désinscrire :-) "
		},
		"en": {
			"setlanguage-choose": "Please pick one of the currently available languages.",
			"setlanguage-chosen": "The bot's language has been set to English",
			"tournament-system-tournament-not-found-error": "en",
			"tournament-system-participant-not-found": "enaction non effectuée, impossible de trouver dans la liste des participants du tournoi (est-il bien inscrit?) le joueur suivant : ",
			"tournament-join-prefix": "enRésultats de l'inscription au tournoi ",
			"tournament-system-unauthorized-access": "envous ne pouvez pas rejoindre ce tournoi car il n'est pas organisé par l'administrateur de votre Discord",
			"tournament-system-registration-closed": "enil n'est plus possible de s'inscrire au tournoi. Le tournoi doit être commencé ou fini.",
			"tournament-system-join-error": "enErreur lors de l'inscription : ",
			"tournament-system-join-error-reason1": "enle tournoi est complet et ne possède pas de file d'attente.",
			"tournament-system-join-success": "envotre inscription au tournoi a bien été prise en compte",
			"tournament-system-join-success-waiting-list": "enle tournoi est complet : vous avez été placé en file d'attente",
			"tournament-leave-prefix": "enRésultats de la désinscription au tournoi ",
			"tournament-system-leave-error": "enErreur inconnue lors de la désinscription au tournoi. Vous ne pouvez vous désinscrire qu'aux tournois de l'organisateur de ce Discord",
			"tournament-system-participant-disactivated": "envous avez déclaré forfait avec succès pour les prochains matchs du tournoi (votre participation est désactivée). Si vous voulez reprendre le tournoi, contactez l'admin du tournoi.",
			"tournament-system-leave-success": "envotre désinscription au tournoi a bien été prise en compte",
			"tournament-next-match-prefix": "enRecherche de votre prochain match pour le tournoi ",
			"tournament-system-next-match-tournament-not-started": "en le tirage au sort n'a pas encore été effectué. Votre prochain match est donc encore inconnu.",
			"tournament-system-tournament-is-finished": " enle tournoi est terminé, il n y a plus de matchs à jouer.",
			"tournament-system-winner-is-error": "enIl y a eu une erreur lors de la déclaration du vainqueur. Voir avec l'admin",
			"join-command-description": "Join a tournament by specifying its code (code is given in the tournament description)",
			"join-command-trcode-missing-arg": "Add tournament's code you would like to join",
			"join-command-already-registered": "envous êtes déjà inscrit au tournoi demandé",
			"leave-command-description": "Leave a tournament by specifying its code (code is given in the tournament page)",
			"leave-command-trcode-missing-arg": "Precise the tournament code you would like to leave",
			"leave-command-already-left": "envous n'êtes pas inscrit à ce tournoi, vous ne pouvez donc pas vous en désinscrire :-) "

		}
	}
}